#Задание
#Даны два целых положительных числа n и m.
#Создайте двумерный массив (список списков) размером n×m, заполненный нулями, и выведите его на экран.
#n - строк, m - столбцов.
#Формат входных данных
#Даны два целых числа n и m, каждое на отдельной строке.
#Формат выходных данных
#Выведите полученный двумерный список в виде таблицы, каждый ряд на отдельной строке, элементы разделены проблелами.
n = int(input())
m = int(input())
matrix = []
for i in range(n):
    matrix.append([0] * m)
for row in matrix:
    print(*row)