#Задание
#Дана квадратная матрица n×n
#, переданная в виде строк с целыми числами.
#Сформируйте список, состоящий из элементов, лежащих на главной диагонали этой матрицы (от левого верхнего до правого нижнего угла).
#Формат входных данных
#На первой строке дано целое число n
#.
#На следующих n
#строках даны элементы матрицы — по n
#целых чисел на каждой строке, разделенные пробелами.
#Формат выходных данных
#Выведите список элементов главной диагонали.
n = int(input())
matrix = []
for i in range(n):
    matrix.append(list(map(int,input().split())))
#print(matrix)

list_main = []
for i in range(n):
    list_main.append(matrix[i][i])
print(list_main)