#Задание
#Дано целое число n.
#Сформируйте единичную матрицу размером n×n
#(двумерный список, в котором на главной диагонали стоят единицы, а все остальные элементы равны нулю).
#Формат входных данных
#Дано одно целое положительное число n.
#Формат выходных данных
#Выведите полученный двумерный список в виде таблицы, каждый ряд на отдельной строке, элементы разделены проблелами.
n  = int(input())
matrix = []
for i in range(n):
    matrix.append([0] * n)
    matrix[i][i] = 1
#print(matrix)
for row in matrix:
    print(*row)

