#Задание
#Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась.
#Найдите ее, зная номера оставшихся карточек.
#Вводится число n - количество карточек, затем n−1 чисел: номера оставшихся карточек (различные числа от 1 до n).
#Программа должна вывести номер потерянной карточки.
#Формат входных данных
#Дано целое число n - количество карточек
#И еще n-1 целых чисел: номера оставшихся карточек.
#Все числа вводятся на отдельных строках.
#Формат выходных данных
#Выведите номер потерянной карточки.
n = int(input())
numbers_cards = []
i = 0
while i < n - 1:
    numbers_cards.append(int(input()))
    i += 1
#print(numbers_cards)

all_cards = []
for i in range(1, n + 1):
    all_cards.append(i)
#print(all_cards)
print(*(set(all_cards) - set(numbers_cards)))