# Задание
# Для безопасности на сайте нужно скрыть первые 12 цифр номера банковской карты, оставив видимыми только последние 4.
# Номер карты состоит из 16 цифр, которые могут быть разделены дефисами или пробелами (например, 1234-5678-9012-3456 или 1234 5678 9012 3456).
# Входные данные
# Строка, содержащая 16-ти значный номер карты.
# Выходные данные
# Строка, где вместо первых 12 цифр стоят звездочки в формате ****-****-****-3456 (сохраняя исходные разделители).
import re
number_card = input() #"3545-2564-7841-4585"
#template = r'\d{4}-\d{4}-\d{4}'
#result = re.sub(template,'****-****-****', number_card)
template = r'\d{4}'
result = re.sub(template,'****', number_card, count = 3)
print(result)