#Задание
#Даны сторона квадрата. Вывести его диагонали символами #
#Формат входных данных
#Дано целое число n, длина стороны квадрата. 1 < n < 20
#Формат выходных данных
#Вывести диагонали квадрата символами # (см. примеры)
#
#Примеры
#n = 6
#
# #    #
#  #  #
#   ##
#   ##
#  #  #
# #    #
#n = 3
#
# # #
#  #
# # #
n = int(input())
matrix = []
for i in range(n):
    matrix.append([" "] * n)
    matrix[i][i] = "#"
    matrix[i][n-1-i] = "#"
#print(matrix)
for row in matrix:
    print(*row,sep="")


