# Задание
#
# Напишите функцию get_word_stats(word), которая принимает в качестве аргумента одно слово и анализирует его состав.
# Функция должна определять длину слова, количество гласных и количество согласных букв.
#
# В подсчете гласных и согласных букв участвуют только буквы русского алфавита (как строчные, так и заглавные). Буква «ё» считается гласной.
# Подсчет должен быть регистронезависимым.
#
# Формат входных данных
#
# Функция принимает один параметр word — строку (str), состоящую из одного слова без пробелов и знаков препинания (буквы русского алфавита).
#
# Формат выходных данных
#
# Функция должна возвращать кортеж (tuple) из трех целых чисел в следующем порядке:
#
# Длина слова.
#
# Количество гласных букв (а, е, ё, и, о, у, ы, э, ю, я).
#
# Количество согласных букв (б, в, г, д, ж, з, й, к, л, м, н, п, р, с, т, ф, х, ц, ч, ш, щ).
#
# Примеры
#
# Пример 1:
#
# Входные данные: get_word_stats("Питон")
#
# Результат функции: (5, 2, 3)
#
# Пример 2:
#
# Входные данные: get_word_stats("Экзамен")
#
# Результат функции: (7, 3, 4)

def get_word_stats(word):
    word_lower = word.lower()
    vowel_letters = {'а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я'}
    consonant_letters = {'б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ'}
    count_vowel_l = 0
    count_consonant_l = 0
    len_word = len(word)

    for letter in word_lower:
        if letter in vowel_letters:
            count_vowel_l += 1
        if letter in consonant_letters:
            count_consonant_l += 1
    # print(len_word, count_vowel_l, count_consonant_l)
    result = (len_word, count_vowel_l, count_consonant_l)
    return(result)

w = input()
res = get_word_stats(w)
print(res)

