# Задание
# Даны две строки: первая содержит ключи словаря, вторая — соответствующие им значения. Элементы в строках разделены пробелами.
# Создайте словарь, где элементы из первой строки являются ключами, а элементы из второй — значениями, и выведите полученный словарь.
# Гарантируется, что количество ключей и значений одинаковое.
# Входные данные
# В первой строке — ключи словаря, разделённые пробелами.
# Во второй строке — значения словаря, разделённые пробелами.
# Выходные данные
# Словарь, сформированный из введенных ключей и значений.

string_keys = input().split()
string_values = input().split()
dict_string = {}

#print(list(zip(string_keys,string_values)))
list_of_string = list(zip(string_keys,string_values))
#print(list_of_string)
for key, value in list_of_string:
    #print(f"{key} {value}")
    dict_string[key] = value
print(dict_string)

