# Задание
# Дан текстовый файл salaries.txt, содержащий информацию о зарплатах сотрудников.
#
# Необходимо отфильтровать список и записать в новый текстовый файл highly_paid.txt всех сотрудников, чья зарплата строго больше 60 000.
#
# Формат входных данных
# Входной файл salaries.txt имеет текстовый формат.
#
# Первая строка — заголовок таблицы, содержащий названия столбцов, разделенные произвольным количеством пробелов или табуляцией: Фамилия Имя Отчество Зарплата
#
# Каждая последующая строка содержит данные об одном сотруднике: фамилию, имя, отчество (строки) и зарплату (целое число), разделенные одним или несколькими пробельными символами (пробелами или \t).
#
# Формат выходных данных
# Создайте (или перезапишите) файл highly_paid.txt.
#
# В файл должны быть выведены только те сотрудники, у которых значение в столбце «Зарплата» строго больше 60000.
#
# Каждая строка выходного файла должна содержать информацию об одном сотруднике в формате: Фамилия И.О.
# (где И. — первая буква имени с точкой, О. — первая буква отчества с точкой).
#
# Зарплату и заголовок таблицы в выходной файл записывать не нужно. Вместо зарплаты вывести !
#
# Порядок следования сотрудников в выходном файле должен сохранять исходный порядок
# из входного файла.

with open("salaries.txt","r", encoding="utf-8") as file:
    dict_salaries = {}
    list_salaries = []

    dict_salaries_keys = file.readline().strip().split()  #из заголовка создаем список ключей для справочника
    #print(dict_salaries_keys)

    #добавляем остальные строки файла в список, как вложенные списки
    for line in file:
        #print(line.strip().split())
        list_salaries.append(line.strip().split())
        #print(list_salaries)
    #print(list_salaries)

    #из списка создаем словарь сотрудников с вложенными словарями
    num_salary = 1
    for list in list_salaries:
       #print(list)
        dict_salaries[num_salary] = dict(zip(dict_salaries_keys,list))
        num_salary += 1
        #print(dict_salaries)
    #print(dict_salaries)

    #открываем файл на запись и записываем в файл результат, удовлетворяющий условиям отбора
    with open("highly_paid.txt", "w", encoding="utf-8") as file:
        for num_salary, info_salary in dict_salaries.items():
            if int(info_salary.get("Зарплата", 0)) > 60000:
                #print(info_salary.get("Фамилия")+" "+info_salary.get("Имя")[0]+"."+info_salary.get("Отчество")[0]+".")
                line_to_write = info_salary.get("Фамилия")+" "+info_salary.get("Имя")[0]+"."+info_salary.get("Отчество")[0]+".\n"
                file.writelines(line_to_write)