# Задание
# Напишите функцию is_strong_password(password), которая проверяет надёжность переданного пароля на соответствие критериям безопасности.
# Пароль считается надёжным, если он одновременно удовлетворяет следующим условиям:
# Длина строки составляет не менее 8 символов.
# Содержит хотя бы одну заглавную латинскую или русскую букву.
# Содержит хотя бы одну строчную латинскую или русскую букву.
# Содержит хотя бы одну цифру (0–9).
# Формат входных данных
# Функция принимает один параметр password — строку (str), содержащую проверяемый пароль.
# Строка может состоять из латинских и русских букв, цифр и специальных символов.
#
# Формат выходных данных
# Функция должна возвращать булево значение (bool):
# True — если пароль соответствует всем четырем критериям надёжности.
# False — если пароль не соответствует хотя бы одному из критериев.
# Примеры
#
# Пример 1:
# Входные данные: is_strong_password("Pass1234")
# Выходные данные: True
# Пример 2:
# Входные данные: is_strong_password("password")
# Выходные данные: False (отсутствуют заглавные буквы и цифры)


def is_strong_password(password):
    import re
    template_pswd = r"(?=.*[a-zа-яё])(?=.*[A-ZА-ЯЁ])(?=.*\d).{8,}"
    if re.match(template_pswd, password) is None:
       return False
    return True

pswd = input()
res = is_strong_password(pswd)
print(res)