#Даны координаты точки, координаты центра круга и его радиус.
#Определить принадлежит ли данная точка кругу.
#Будем считать, что точка принадлежит кругу, если находится внутри его или на его окружности
#Формат входных данных
#Даны координаты точки (x, y) - два целых числа, каждое на отдельной строке
#Координаты центра круга (xr, yr) - два целых числа, каждое на отдельной строке
#Радиус круга - целое положительное число.
#Формат выходных данных
#Вывести "Да", если точка принадлежит кругу, и "Нет" в противоположном случае.
x = int(input())
y = int(input())
xr = int(input())
yr = int(input())
r  = int(input())
if (x - xr)**2 + (y - yr)**2 <= r**2 :
    print ("Да")
else:
    print ("Нет")