#import re
#string = "Выйду ночюб в поле с Конем"
#template=r"[А-Я]\w+"
#result = re.findall(template,string)
#print(result)

# Задание
# Дано произвольное предложение, содержащее знаки препинания. Слова в предложении разделены пробелами.
# Найдите:
# Первое слово из введенной строки.
# Первые два символа каждого слова.
# Входные данные
# Одна строка, содержащая произвольный текст (предложение с пробелами и знаками препинания).
#
# Выходные данные
# В первой строке — первое слово из исходного текста.
# Во второй строке — первые два символа каждого слова через пробел.

#Быстрая коричневая лиса прыгает через ленивую собаку. А я смотрю на нее.
import re
text  = "Привет, как у тебя дела?" #input()
#извлечь все слова
template_words = r"[А-Яа-я]+"
#записать в список
words = re.findall(template_words, text)
first_word = words[0]
print(first_word)

#извлечь первые две буквы каждого слова
two_letters = r"\b[А-Яа-я]{1,2}"
result = re.findall(two_letters, text)
print(result)