#Задача
#Дан словарь, где ключи — имена студентов, а значения — их итоговые оценки за курс. Напишите программу, которая инвертирует словарь: создает новый словарь, где ключами становятся оценки, а значениями — списки студентов, получивших эту оценку.
#Входные данные
#Исходный словарь студентов и их оценок.
#Выходные данные
#Новый словарь с группировкой студентов по оценкам.
student_marks = {
    "Анна": 5,
    "Иван": 4,
    "Мария": 5,
    "Петр": 3,
    "Елена": 4
}
marks = {}
for name, mark in student_marks.items():
    if mark in marks:
        marks[mark].append(name)
    else:
        marks[mark] = [name]
print(marks)