#Задание
#Анаграммы - слова, составленные из одних и тех же букв.
#Даны две строки, проверить, являются ли они анаграммами.
#Формат входных данных
#Две произвольные строки, каждая на отдельной строке. В строка присутствуют только буквы.
#Формат выходных данных
#Вывести "Да" - если строки являются анаграммами и "Нет" - в противоположном.
#Решите задачу без учета регистра, т.е. слома "Автор" и "Товар", являются анаграммами.
word1 = list(input().lower())
word2 = list(input().lower())
if len(word1) == len(word2):
    for letter in word2:
        word1.remove(letter)
if len(word1) == 0:
    print("Да")
else:
    print("Нет")